W6D4/snoopy_day_2/app/controllers/users_controller.rb

  def create
    # render json: params
    user = User.new(user_params)
    if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Henry"], ["email", "HENRY@gmail.com"], ["created_at", "2020-01-23 00:56:23.285276"], ["updated_at", "2020-01-23 00:56:23.285276"]]

  def show

    # user = User.find_by(id: params[:id])
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]